app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `password_digest`, `created_at`, `updated_at`, `email`) VALUES ('danielbpc', '$2a$12$/cxNYKDIwfsqo9w1JzAReufUCTDF9fzg6AbQsp7KAHLUXvvSLvSeq', '2020-09-17 16:22:34.385804', '2020-09-17 16:22:34.385804', 'danielbpc2@hotmail.com')
---
  def create
    @new_user = User.new(user_params)
    if params[:role].present? && !@user.is_admin?
      return render json: { message: "Você não tem permissão para essa ação" }, status: :unauthorized
    end

    if @new_user.save

UPDATE `users` SET `users`.`name` = 'Daniel', `users`.`password_digest` = '$2a$12$VdPE7UhC0hwsONT7p3zymun/iO848ouJHTxcyMShKpT5rrJAvNPv2', `users`.`updated_at` = '2020-09-17 19:57:06.285562' WHERE `users`.`id` = 2
---
  def update
    if !@user.can_make_changes?(params[:id])
      return render json: { message: "Você não tem permissão para essa ação" }, status: :unauthorized
    end

    if @params_user.update(user_params)

DELETE FROM `users` WHERE `users`.`id` = 2
---
  def destroy
    if !@user.can_make_changes?(params[:id])
      return render json: { message: "Você não tem permissão para essa ação" }, status: :unauthorized
    end

    if @params_user.destroy!

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'lcassiol@hotmail.com' LIMIT 1
---
  def login
    @user = User.find_by(email: params[:email])

SELECT `users`.* FROM `users` WHERE `users`.`id` = NULL LIMIT 1
---
  def set_user
    @params_user = User.find(params[:id])